app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def index
    @locations = Location.all

SELECT "locations".* FROM "locations" WHERE "locations"."id" = 2 LIMIT 1
SELECT "libraries".* FROM "libraries" WHERE (name ILIKE '%Agri Togo%')
---
  def edit
    @location = Location.find(params[:id])
    @libraries = Library.where("name ILIKE '%#{@location.name}%'")

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = 2 LIMIT 1
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1
UPDATE "locations" SET "fax" = '220 31 25', "updated_at" = '2011-03-28 21:13:21.879954', "website" = '', "address" = '313 Bvd du 13 Janvier, Immeuble Avenida, BP 8480', "email" = 'http://togophonebook.com/c/e/106520/948.gifhttp://togophonebook.com/c/e/106520/949.gif', "telephone" = '220 31 24' WHERE "locations"."id" = 3
---
  def update
    @library = Library.find(params[:post][:library_id])
    Location.find(params[:id]).update_attributes(:address => @library.address,
                                                :telephone => @library.telephone,
                                                :fax => @library.fax,
                                                :email => @library.email,
                                                :website => @library.website)

SELECT "libraries".* FROM "libraries" WHERE "libraries"."name" IN ('SOCA TOGO - JAGO, GINO, POMO', NULL)
---
  def custom
    #@selected_text = params.first #hash on the form {"SOCA TOGO - JAGO" => nil, "action" => "cutom", "controller" => "locations"}
    #@attributes = Library.where(:name => @selected_text).to_json.sub('[{"library":', '').sub('}]', '')
    @selected_text = params.to_s.sub('actioncustom', '').sub('controllerlocations', '')# params retourne un hash de la forme {"SOCA TOGO - JAGO" => nil, "action" => "cutom", "controller" =>  "locations"}
    @attributes = Library.where(:name => @selected_text).to_json.sub('[{"library":', '').sub('}]', '')